DinoTools/CLTMatrix/hardware/cltmatrix/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################
cltmatrix.name=CLT-Matrix

cltmatrix.upload.tool=arduino:avrdude
cltmatrix.upload.protocol=arduino

cltmatrix.bootloader.tool=avrdude
cltmatrix.bootloader.low_fuses=0xFF
cltmatrix.bootloader.unlock_bits=0x3F
cltmatrix.bootloader.lock_bits=0x0F

cltmatrix.build.f_cpu=20000000L
cltmatrix.build.core=arduino:arduino
cltmatrix.build.variant=arduino:standard

cltmatrix.menu.cpu.atmega328=ATmega328

cltmatrix.menu.cpu.atmega328.upload.maximum_size=32256
cltmatrix.menu.cpu.atmega328.upload.maximum_data_size=2048
cltmatrix.menu.cpu.atmega328.upload.speed=19200

cltmatrix.menu.cpu.atmega328.bootloader.high_fuses=0xDE
cltmatrix.menu.cpu.atmega328.bootloader.extended_fuses=0x05
cltmatrix.menu.cpu.atmega328.bootloader.file=atmega/optiboot_cltmatrix328.hex

cltmatrix.menu.cpu.atmega328.build.mcu=atmega328p

cltmatrix.menu.cpu.atmega168=ATmega168

cltmatrix.menu.cpu.atmega168.upload.maximum_size=15872
cltmatrix.menu.cpu.atmega168.upload.maximum_data_size=1024
cltmatrix.menu.cpu.atmega168.upload.speed=19200

cltmatrix.menu.cpu.atmega168.bootloader.high_fuses=0xdd
cltmatrix.menu.cpu.atmega168.bootloader.extended_fuses=0x04
cltmatrix.menu.cpu.atmega168.bootloader.file=atmega/optiboot_cltmatrix168.hex

cltmatrix.menu.cpu.atmega168.build.mcu=atmega168
